In [2]:
import pandas as pd

In [18]:
data={
    'Name':['pawan','lalith','ishan','om','kapil'],
    'Age':[24,None,43,23,None],
    'Salary':[5000,6000,7000,None,None]
}

df=pd.DataFrame(data)
df

     Name   Age  Salary
0   pawan  24.0  5000.0
1  lalith   NaN  6000.0
2   ishan  43.0  7000.0
3      om  23.0     NaN
4   kapil   NaN     NaN

In [20]:
df.isnull()

    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False   False
3  False  False    True
4  False   True    True

In [24]:
df.isnull().sum()

Name      0
Age       2
Salary    2
dtype: int64

In [26]:
df.dropna()

    Name   Age  Salary
0  pawan  24.0  5000.0
2  ishan  43.0  7000.0

In [28]:
df.dropna(axis=1)

     Name
0   pawan
1  lalith
2   ishan
3      om
4   kapil

In [30]:
df

     Name   Age  Salary
0   pawan  24.0  5000.0
1  lalith   NaN  6000.0
2   ishan  43.0  7000.0
3      om  23.0     NaN
4   kapil   NaN     NaN

In [32]:
df.fillna("not known yet")

     Name            Age         Salary
0   pawan           24.0         5000.0
1  lalith  not known yet         6000.0
2   ishan           43.0         7000.0
3      om           23.0  not known yet
4   kapil  not known yet  not known yet

In [42]:
df[['Age']].fillna(24)

    Age
0  24.0
1  24.0
2  43.0
3  23.0
4  24.0

In [48]:
df.isnull().mean()*100 #how much % of data is missing

Name       0.0
Age       40.0
Salary    40.0
dtype: float64